OpenFOAM/toyProblem2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p 0.026381909547739
    volScalarFieldValue T 0.208502188361161
    volVectorFieldValue U (0 -2.228079401215960 0)
);

regions
(
    boxToCell
    {
        box (0 -2 0) (4 1 0.1);
        fieldValues
        (
            volScalarFieldValue p 0.75
            volScalarFieldValue T 1.05
            volVectorFieldValue U (0 -0.394688351072542 0)
        );
    }
);


// ************************************************************************* //
